first_message_dev = """
Данный бот еще не настроен.
       
Если вы администратор, то вам необходимо настроить данного бота: установить приветственное сообщение и указать чат, в который будут приходить сообщения. Все команды можно найти в @secretary_bot
"""

bot_ready = """Твой бот готов к работе! Теперь ты можешь настроить его, чтоб тебе было удобно. 

Данные команды доступны в ТВОЕМ боте, которого ты создал с помощью @metabot  Их можешь использовать только ты (звездочки вводить НЕ нужно):

/message *Ключ доступа* *ТЕКСТ СООБЩЕНИЯ* - Эта команда устанавливает приветственное сообщение в твоем боте. Пользователи видят его при первом запуске бота. НЕ ЗАБУДЬ указать в тексте команды, с помощью которых люди смогут отправить сообщения (они указаны ниже)

/setchat *Ключ доступа* *ссылка на чат* - команда закрепляет за ботом чат, куда он будет присылать сообщение. ВСЕ участники чата будут видеть сообщения и смогут на них ответить. 

/type *Ключ доступа* - изменить тип сообщений (анонимные, публичные или оба типа). По умолчанию у пользователей есть возможность отправить оба вида сообщений. 

/answer *номер вопроса* *ваше сообщение* - С помощью этой команды можешь ответить на полученные сообщения. 


Данные команды будут доступны для пользователей:

/public *текст сообщения* - Задать вопрос с указанием имени (никнейма)

/anon *текст сообщения* - Задать вопрос анонимно

"""

main_message = """Привет! 

Я помогу тебе создать своего бота-секретаря. Я могу принимать сообщения от других пользователей, собирать обратную связь и передавать их тебе анонимно или с указанием имени. А ты сможешь ответить от своего имени или от имени бота. Тем самым анонимно общаясь с людьми, не выдавая данных своего аккаунта. 


Инструкция: 

1) Создай базового бота с помощью @metabot Для этого перейди к НЕМУ на страницу и следуй ЕГО инструкциям.  

2) Напиши @metabot: /setjoingroups - Этой командой ты разрешишь добавлять своего бота в каналы

3) Создай закрытый чат для получения новых сообщений
Чат должен быть закрытым - все кто в нем находятся смогут отвечать и видеть сообщения секретаря. 

4) Добавь бота в свой чат и выдай ему права администратора

5) Затем возвращайся в диалог со мной. 

6) C помощью команды /addbot Отправь МНЕ сообщение от Метобота похожее на это:

    /addbot
    Success
    botId: 000000001
    nick: testbot
    token: 000.111111111.22222222222:333333333


"""

error_comand_message = """Ошибка! Необходимо набрать команду /message, затем ввести ключ доступа к боту и текст первого сообщения через пробел и только потом нажать отправку. 

Пример: 

/message aa11aaaaa1a Привет!
 
Вы можете связаться со мной публично или анонимно. 
Для этого используйте команды /public или /anon

"""

error_comand_type = """Ошибка! Необходимо набрать команду /type, затем ввести ключ доступа к боту и только потом нажать отправку.

Например: 
/type aa11aaaaa1a

"""

error_comand_public = """Ошибка! Нужно набрать команду /public, затем ввести вопрос и только потом нажать отправку.

Например: 
/public Сколько звезд на небе?

"""

error_comand_anon = """Ошибка! Нужно набрать команду /anon, затем ввести вопрос и только потом нажать отправку.

/anon Сколько тебе лет?

"""
error_comand_both = """Ошибка при отправлении запроса. Необходимо набрать команду /ask или /anon, затем ввести вопрос и только потом нажать отправку."""

error_comand_answer = """Неверная команда, используйте /answer *номер-вопроса* *ваш ответ*

Например: /answer 1 Текст ответа

"""

error_comand = """Данный бот не поддерживает данный тип сообщений"""

ask_success = """Сообщение отправлено.
Ответ придет вам в этот чат с ботом, как только на него ответит владелец бота.

"""
